bluestore/onejob-10compress/randwrite-4k.out
ceph-kern-replicated: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-erasure_1: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-erasure_2: (g=2): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.16
Starting 3 processes

ceph-kern-replicated: (groupid=0, jobs=1): err= 0: pid=16005: Fri Mar  2 11:01:55 2018
  write: io=51376KB, bw=864512B/s, iops=211, runt= 60854msec
    slat (usec): min=14, max=83570, avg=113.22, stdev=738.54
    clat (msec): min=1, max=2842, avg=151.29, stdev=346.72
     lat (msec): min=1, max=2842, avg=151.40, stdev=346.73
    clat percentiles (usec):
     |  1.00th=[ 1912],  5.00th=[ 2288], 10.00th=[ 2640], 20.00th=[ 3568],
     | 30.00th=[ 4512], 40.00th=[ 5920], 50.00th=[15168], 60.00th=[34560],
     | 70.00th=[69120], 80.00th=[142336], 90.00th=[444416], 95.00th=[987136],
     | 99.00th=[1613824], 99.50th=[2113536], 99.90th=[2539520], 99.95th=[2539520],
     | 99.99th=[2637824]
    bw (KB  /s): min=    9, max= 3951, per=100.00%, avg=859.74, stdev=889.85
    lat (msec) : 2=1.59%, 4=23.31%, 10=21.44%, 20=6.54%, 50=12.58%
    lat (msec) : 100=10.22%, 250=10.63%, 500=4.25%, 750=2.30%, 1000=2.19%
    lat (msec) : 2000=4.42%, >=2000=0.53%
  cpu          : usr=0.26%, sys=1.06%, ctx=15343, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=12844/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=1, jobs=1): err= 0: pid=16067: Fri Mar  2 11:01:55 2018
  write: io=24292KB, bw=410804B/s, iops=100, runt= 60552msec
    slat (usec): min=22, max=370611, avg=205.44, stdev=4754.23
    clat (msec): min=18, max=1641, avg=316.86, stdev=253.38
     lat (msec): min=18, max=1641, avg=317.06, stdev=253.43
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   79], 10.00th=[  106], 20.00th=[  141],
     | 30.00th=[  172], 40.00th=[  200], 50.00th=[  231], 60.00th=[  269],
     | 70.00th=[  322], 80.00th=[  433], 90.00th=[  701], 95.00th=[  914],
     | 99.00th=[ 1156], 99.50th=[ 1270], 99.90th=[ 1500], 99.95th=[ 1516],
     | 99.99th=[ 1647]
    bw (KB  /s): min=   13, max=  847, per=91.63%, avg=367.45, stdev=185.87
    lat (msec) : 20=0.02%, 50=1.56%, 100=7.08%, 250=47.11%, 500=27.60%
    lat (msec) : 750=7.41%, 1000=6.26%, 2000=2.96%
  cpu          : usr=0.16%, sys=0.78%, ctx=8856, majf=0, minf=17
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=6073/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_2: (groupid=2, jobs=1): err= 0: pid=16116: Fri Mar  2 11:01:55 2018
  write: io=21088KB, bw=358123B/s, iops=87, runt= 60298msec
    slat (usec): min=22, max=21121, avg=153.33, stdev=295.25
    clat (msec): min=2, max=1855, avg=365.66, stdev=329.94
     lat (msec): min=2, max=1856, avg=365.82, stdev=329.93
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   80], 10.00th=[  104], 20.00th=[  143],
     | 30.00th=[  176], 40.00th=[  206], 50.00th=[  243], 60.00th=[  302],
     | 70.00th=[  371], 80.00th=[  506], 90.00th=[  889], 95.00th=[ 1156],
     | 99.00th=[ 1516], 99.50th=[ 1663], 99.90th=[ 1827], 99.95th=[ 1844],
     | 99.99th=[ 1860]
    bw (KB  /s): min=   16, max=  944, per=100.00%, avg=381.17, stdev=205.27
    lat (msec) : 4=0.21%, 10=0.06%, 20=0.17%, 50=0.99%, 100=7.55%
    lat (msec) : 250=42.66%, 500=28.07%, 750=8.14%, 1000=4.46%, 2000=7.70%
  cpu          : usr=0.07%, sys=0.78%, ctx=7120, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=99.4%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=5272/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=51376KB, aggrb=844KB/s, minb=844KB/s, maxb=844KB/s, mint=60854msec, maxt=60854msec

Run status group 1 (all jobs):
  WRITE: io=24292KB, aggrb=401KB/s, minb=401KB/s, maxb=401KB/s, mint=60552msec, maxt=60552msec

Run status group 2 (all jobs):
  WRITE: io=21088KB, aggrb=349KB/s, minb=349KB/s, maxb=349KB/s, mint=60298msec, maxt=60298msec