bluestore/onejob-10compress/write-1M.out
ceph-kern-replicated: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
ceph-kern-erasure_1: (g=1): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
ceph-kern-erasure_2: (g=2): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
fio-2.16
Starting 3 processes

ceph-kern-replicated: (groupid=0, jobs=1): err= 0: pid=15779: Fri Mar  2 10:58:52 2018
  write: io=2609.0MB, bw=42807KB/s, iops=41, runt= 62410msec
    slat (usec): min=32, max=263429, avg=788.60, stdev=5162.48
    clat (msec): min=62, max=5366, avg=760.62, stdev=699.56
     lat (msec): min=63, max=5367, avg=761.41, stdev=699.47
    clat percentiles (msec):
     |  1.00th=[  159],  5.00th=[  223], 10.00th=[  262], 20.00th=[  326],
     | 30.00th=[  396], 40.00th=[  461], 50.00th=[  545], 60.00th=[  627],
     | 70.00th=[  783], 80.00th=[  988], 90.00th=[ 1483], 95.00th=[ 2089],
     | 99.00th=[ 4015], 99.50th=[ 4490], 99.90th=[ 5342], 99.95th=[ 5342],
     | 99.99th=[ 5342]
    bw (KB  /s): min= 2828, max=95533, per=79.31%, avg=33948.56, stdev=19134.86
    lat (msec) : 100=0.11%, 250=8.39%, 500=36.18%, 750=23.46%, 1000=12.15%
    lat (msec) : 2000=14.11%, >=2000=5.60%
  cpu          : usr=0.03%, sys=0.58%, ctx=3331, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.6%, 32=98.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2609/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=1, jobs=1): err= 0: pid=15876: Fri Mar  2 10:58:52 2018
  write: io=3195.0MB, bw=54010KB/s, iops=52, runt= 60575msec
    slat (usec): min=38, max=6941, avg=534.48, stdev=441.91
    clat (msec): min=14, max=4828, avg=605.94, stdev=611.37
     lat (msec): min=15, max=4829, avg=606.47, stdev=611.34
    clat percentiles (msec):
     |  1.00th=[   44],  5.00th=[   91], 10.00th=[  133], 20.00th=[  188],
     | 30.00th=[  249], 40.00th=[  322], 50.00th=[  400], 60.00th=[  519],
     | 70.00th=[  676], 80.00th=[  865], 90.00th=[ 1303], 95.00th=[ 1942],
     | 99.00th=[ 3032], 99.50th=[ 3261], 99.90th=[ 4015], 99.95th=[ 4817],
     | 99.99th=[ 4817]
    bw (KB  /s): min= 3303, max=170076, per=95.96%, avg=51827.24, stdev=33394.19
    lat (msec) : 20=0.28%, 50=1.06%, 100=4.82%, 250=24.26%, 500=28.08%
    lat (msec) : 750=16.09%, 1000=10.67%, 2000=10.23%, >=2000=4.51%
  cpu          : usr=0.08%, sys=0.74%, ctx=3497, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=0.5%, 32=99.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3195/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_2: (groupid=2, jobs=1): err= 0: pid=15930: Fri Mar  2 10:58:52 2018
  write: io=3097.0MB, bw=52179KB/s, iops=50, runt= 60778msec
    slat (usec): min=38, max=7394, avg=548.63, stdev=451.95
    clat (msec): min=59, max=5091, avg=627.11, stdev=540.14
     lat (msec): min=60, max=5091, avg=627.66, stdev=540.12
    clat percentiles (msec):
     |  1.00th=[  104],  5.00th=[  151], 10.00th=[  184], 20.00th=[  253],
     | 30.00th=[  318], 40.00th=[  392], 50.00th=[  474], 60.00th=[  570],
     | 70.00th=[  693], 80.00th=[  865], 90.00th=[ 1221], 95.00th=[ 1598],
     | 99.00th=[ 3064], 99.50th=[ 3261], 99.90th=[ 3752], 99.95th=[ 3982],
     | 99.99th=[ 5080]
    bw (KB  /s): min= 4096, max=151552, per=100.00%, avg=60367.11, stdev=39278.47
    lat (msec) : 100=0.87%, 250=18.47%, 500=33.26%, 750=21.76%, 1000=9.01%
    lat (msec) : 2000=13.59%, >=2000=3.04%
  cpu          : usr=0.06%, sys=0.80%, ctx=3182, majf=0, minf=18
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=0.5%, 32=99.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3097/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=2609.0MB, aggrb=42807KB/s, minb=42807KB/s, maxb=42807KB/s, mint=62410msec, maxt=62410msec

Run status group 1 (all jobs):
  WRITE: io=3195.0MB, aggrb=54010KB/s, minb=54010KB/s, maxb=54010KB/s, mint=60575msec, maxt=60575msec

Run status group 2 (all jobs):
  WRITE: io=3097.0MB, aggrb=52178KB/s, minb=52178KB/s, maxb=52178KB/s, mint=60778msec, maxt=60778msec